ubnt-Alexey-Kuvshinov/stm32projects/LoRaMote/src/stm32l152x_board.c
	//Configure SDA Pin as : Alternate function, High Speed, Open drain, Pull up
	configurePortPinAsAf(I2C1_SDA_PORT, I2C1_SDA_BIT, GPIO_AF_4);
	configurePortPinOpenDrain(I2C1_SDA_PORT, I2C1_SDA_BIT);
//	  LL_GPIO_SetPinMode(GPIOB, LL_GPIO_PIN_9, LL_GPIO_MODE_ALTERNATE);
//	  LL_GPIO_SetAFPin_8_15(GPIOB, LL_GPIO_PIN_9, LL_GPIO_AF_4);
//	  LL_GPIO_SetPinSpeed(GPIOB, LL_GPIO_PIN_9, LL_GPIO_SPEED_FREQ_HIGH);
//	  LL_GPIO_SetPinOutputType(GPIOB, LL_GPIO_PIN_9, LL_GPIO_OUTPUT_OPENDRAIN);
//	  LL_GPIO_SetPinPull(GPIOB, LL_GPIO_PIN_9, LL_GPIO_PULL_UP);

	  LL_I2C_Disable(I2C1);												//Disable I2C1 prior modifying configuration registers

		/* I2C SPEEDCLOCK define to max value: Fast Mode @400kHz */
//		#define I2C_SPEEDCLOCK           400000
//		#define I2C_DUTYCYCLE            LL_I2C_DUTYCYCLE_2

	  LL_I2C_ConfigSpeed(I2C1, 16000000, 400000, LL_I2C_DUTYCYCLE_2);

	  LL_I2C_Enable(I2C1);
}

static inline void configureRadio(void)
{
	LL_SYSCFG_SetEXTISource(LL_SYSCFG_EXTI_PORTC, LL_SYSCFG_EXTI_LINE6);//Connect DIO0 pin to EXTI6 line
	LL_EXTI_EnableRisingTrig_0_31(EXTI_IMR_IM6);						//configure EXTI6 for rising trigger interrupt
	LL_EXTI_EnableIT_0_31(EXTI_IMR_IM6);								//enable line 6 interrupt in EXTI
	LL_SYSCFG_SetEXTISource(LL_SYSCFG_EXTI_PORTC, LL_SYSCFG_EXTI_LINE8);//Connect DIO3 pin to EXTI8 line
	LL_EXTI_EnableRisingTrig_0_31(EXTI_IMR_IM8);						//configure EXTI8 for rising trigger interrupt
	LL_EXTI_EnableIT_0_31(EXTI_IMR_IM8);								//enable line 8 interrupt in EXTI
	NVIC_SetPriority(EXTI9_5_IRQn, GPIO_PRIORITY);						//enable the EXTI lines interrupt in interrupt controller
	NVIC_EnableIRQ(EXTI9_5_IRQn);
}

void init_Board_Peripherals(void)
{
	//enable peripherals
	LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_GPIOA);				//enable port A
	LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_GPIOB);				//enable port B
	LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_GPIOC);				//enable port C
	LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_GPIOD);				//enable port D
	LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_SYSCFG);				//enable system configuration or writing to SYSCFG has no effect
	LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_USART1);				//enable UART1 peripheral
	LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_USART2);				//enable UART2 peripheral
	LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_SPI2);					//enable SPI2 peripheral
//	LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_LPTIM1);				//enable low-power timer
	LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_I2C1);					//Enable the peripheral clock for I2C1

	LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_PWR);				//trying to enable debug interface

	//RCC_APB2PeriphClockCmd(RCC_APB2Periph_DBGMCU, ENABLE);

	//LL_DBGMCU_GetDeviceID(void)
	LL_DBGMCU_EnableDBGStopMode();
	LL_DBGMCU_EnableDBGStandbyMode();
	LL_DBGMCU_APB1_GRP1_FreezePeriph(LL_DBGMCU_APB1_GRP1_RTC_STOP);

	//configure inputs
	for(tmp = 0; tmp < sizeof(inputs) / sizeof(struct GPIO_Line); tmp++)
		configurePortPinAsInput(inputs[tmp].port, inputs[tmp].bit);

	configurePortPinPullDown(PORT_A, BUTTON_BIT);

	//configure outputs
	boardGreenLedOff();
	boardRedLedOff();
	boardYellowLedOff();
	setPortBit(RADIO_RESET_PORT, RADIO_RESET_BIT);
	for(tmp = 0; tmp < sizeof(outputs) / sizeof(struct GPIO_Line); tmp++)
		configurePortPinAsOutput(outputs[tmp].port, outputs[tmp].bit);

	//configure blue Button
	configureButton();

	//configure GPS interface
	configureUart1();

	//configure command interface
	configureUart2();													//enable and configure UART2

	//configure radio communication interface
	configureSpi2();

    //start RTC, clock source is actually set for the first time only, then proper RTC domain reset is needed to change it
	enableRTC();

	enableLPTim();

	configureI2C1();

//	LL_PWR_EnableWakeUpPin(uint32_t WakeUpPin);

	//radio-related configuration
	configureRadio();

	//activate GPS
	//setPortBit(GPS_ENABLE_PORT, GPS_ENABLE_BIT);
}

/*
//LPTIM is absent on this MCU, using RTC instead. Timeout is 2 - 1024 * 59 i.e. 2/1024s - 59s		(timeout of 1/1024 does not trigger)
void startLpTimer(uint16_t timeout)
{
	volatile uint32_t second;
	volatile uint32_t subsecond;

//	LL_RTC_DisableWriteProtection(RTC);
	LL_RTC_ALMB_Disable(RTC);
	RTC->ISR = ~(RTC_ISR_ALRBF | RTC_ISR_INIT) | (RTC->ISR & RTC_ISR_INIT);	//Clear the AlarmB interrupt pending bit

	if(timeout > 60 * 1024 - 1)
		timeout = 60 * 1024 - 1;
	if(timeout < 2)
		timeout = 2;

	//	while(!LL_RTC_IsActiveFlag_RS(RTC));						//shadow regs updated
	second = __LL_RTC_CONVERT_BCD2BIN(LL_RTC_TIME_GetSecond(RTC)) + timeout / 1024;
	subsecond = LL_RTC_TIME_GetSubSecond(RTC);
	(void)LL_RTC_ReadReg(RTC, DR);										//unfreeze time/date registers

	timeout %= 1024;
	if(timeout > subsecond) {
		subsecond = 1024 - timeout + subsecond;
		second++;
	} else
		subsecond -= timeout;
	if(second > 59)
		second -= 60;

	while(!LL_RTC_IsActiveFlag_ALRBW(RTC));
	LL_RTC_ALMB_SetSubSecond(RTC, subsecond);
	LL_RTC_ALMB_SetSecond(RTC, __LL_RTC_CONVERT_BIN2BCD(second));
	LL_RTC_ALMB_Enable(RTC);
//	LL_RTC_EnableWriteProtection(RTC);
}
*/

//Timeout range is from 2 to 1024 * 60 * 60 - 1 (3 686 399) i.e. 2/1024s - 60 min (timeout of 1/1024 does not trigger)
//event is the flag to be set when timer expires
void setTimer(uint32_t timeout, uint32_t event)
{
	volatile uint32_t minute;
	volatile uint32_t second;
	volatile uint32_t subsecond;
	TimerQueue newEntry;

//	LL_RTC_DisableWriteProtection(RTC);
	LL_RTC_ALMB_Disable(RTC);
//	RTC->ISR = ~(RTC_ISR_ALRBF | RTC_ISR_INIT) | (RTC->ISR & RTC_ISR_INIT);	//Clear the AlarmB interrupt pending bit

	//verify timeout range
	if(timeout > 60 * 60 * 1024 - 1)
		timeout = 60 * 60 * 1024 - 1;
	if(timeout < 2)
		timeout = 2;

	//calculate RTC values corresponding to current time + timeout
	//	while(!LL_RTC_IsActiveFlag_RS(RTC));							//shadow regs updated
	minute = __LL_RTC_CONVERT_BCD2BIN(LL_RTC_TIME_GetMinute(RTC)) + timeout / (1024 * 60);
	second = __LL_RTC_CONVERT_BCD2BIN(LL_RTC_TIME_GetSecond(RTC)) + (timeout % (1024 * 60)) / 1024;
	subsecond = LL_RTC_TIME_GetSubSecond(RTC);
	(void)LL_RTC_ReadReg(RTC, DR);										//unfreeze time/date registers

	timeout %= 1024;
	if(timeout > subsecond) {
		subsecond = 1024 - timeout + subsecond;
		second++;
	} else
		subsecond -= timeout;

