ubnt-Alexey-Kuvshinov/stm32projects/LoRaMote/src/stm32l152x_board.c
	subsecond = 1024 - subsecond;										//this tricky trick is needed for correct time comparison of TimerQueue.time values, should be reverted back when written to RTC alarm subseconds register

	if(second > 59) {
		second -= 60;
		minute++;
	}

	if(minute > 59)
		minute -= 60;

	//add the event to timer schedule
	newEntry.event = event;
	newEntry.minutes = minute;
	newEntry.seconds = second;
	newEntry.subseconds = subsecond;

	for(uint8tmp = 0; uint8tmp < TIMER_SCHEDULE_SIZE; uint8tmp++)		//if the same event is already scheduled remove it first
		if(event == timerSchedule[uint8tmp].event) {
			memmove(&timerSchedule[uint8tmp], &timerSchedule[uint8tmp + 1], (TIMER_SCHEDULE_SIZE - 1 - uint8tmp) * sizeof(TimerQueue));
			timerSchedule[TIMER_SCHEDULE_SIZE - 1].event = HWE_NO_EVENT;//make sure the last entry is free to use now
			break;
		}

	if(HWE_NO_EVENT != timerSchedule[TIMER_SCHEDULE_SIZE - 1].event)	//now check if scheduling table has room for the new event
		ErrorHandler("Timer is full");									//TODO: this is endless loop, should be changed to device reset

	for(uint8tmp = 0; uint8tmp < TIMER_SCHEDULE_SIZE; uint8tmp++) {		//schedule the new event
	//TODO: implement less than 2 subseconds (including 0) time difference between events, by triggering next event simultaneously
	//	if((HWE_NO_EVENT != timerSchedule[uint8tmp].event) && (abs(timerSchedule[uint8tmp].time - newEntry.time) < 10))
	//		break;

		if((HWE_NO_EVENT == timerSchedule[uint8tmp].event) || (newEntry.time <= timerSchedule[uint8tmp].time)) {
			memmove(&timerSchedule[uint8tmp + 1], &timerSchedule[uint8tmp], (TIMER_SCHEDULE_SIZE - 1 - uint8tmp) * sizeof(TimerQueue));
			timerSchedule[uint8tmp].time = newEntry.time;
			timerSchedule[uint8tmp].event = newEntry.event;
			break;
		}
	}

	//reprogram the alarm if the new event timeout expires first
	if(0 == uint8tmp) {
		while(!LL_RTC_IsActiveFlag_ALRBW(RTC));
		LL_RTC_ALMB_SetSubSecond(RTC, 1024 - subsecond);
		LL_RTC_ALMB_SetSecond(RTC, __LL_RTC_CONVERT_BIN2BCD(second));
		LL_RTC_ALMB_SetMinute(RTC, __LL_RTC_CONVERT_BIN2BCD(minute));
	}

	LL_RTC_ALMB_Enable(RTC);
//	LL_RTC_EnableWriteProtection(RTC);
}


void EnableGps(void)
{
	setPortBit(GPS_ENABLE_PORT, GPS_ENABLE_BIT);
}

void DisableGps(void)
{
	resetPortBit(GPS_ENABLE_PORT, GPS_ENABLE_BIT);
}

void startUart2Msg(uint8_t command)
{
	while(HardwareEvents & HWE_UART2_TRANSMITTING);						//make sure not to screw up a message that may be currently in progress
	Uart2Tx.size = 1;													//reserve space for message length
	Uart2Tx.data[Uart2Tx.size++] = command;
}

void addToUart2Msg(uint8_t byte)
{
	if(Uart2Tx.size >= sizeof(Uart2Tx.data))
		ErrorHandler("addToUart2Msg() error");
	else
		Uart2Tx.data[Uart2Tx.size++] = byte;
}

void sendUart2Message(void)
{
	HardwareEvents |= HWE_UART2_TRANSMITTING;							//uart transmission is in progress
	Uart2Tx.data[0] = Uart2Tx.size;										//number of bytes in a message including first length byte
	Uart2Tx.counter = 0;												//TX buffer should be filled and size properly set
	USART_ptr(USART_2)->CR1 |= USART_CR1_TCIE;							//enable transfer complete interrupt initiating interrupt - driven transmission
}

void uart2SendText(char *text)
{
	while(HardwareEvents & HWE_UART2_TRANSMITTING);
	startUart2Msg(RC_TEXT);

	Uart2Tx.size = strlen(text);
	if(Uart2Tx.size > sizeof(Uart2Tx.data) - 2)
		Uart2Tx.size = sizeof(Uart2Tx.data) - 2;
	memcpy(Uart2Tx.data + 2, text, Uart2Tx.size);
	Uart2Tx.size += 2;
	sendUart2Message();
}

void spiAccessRegisters(uint8_t *data, uint8_t length)
{
	resetPortBit(RADIO_NSS_PORT, RADIO_NSS_BIT);						//start SPI transaction - assert data frame start

	(void)SPI2->DR;														//read and discard RX buffer to clear RXNE, just in case

	while(length--)
	{
		SPI2->DR = *data;												//write a data byte
		while(0 == (SPI2->SR & SPI_SR_RXNE));							//wait until reply is ready
		*(data++) = SPI2->DR;											//save the reply. * Address byte will be overwritten with 0
	}

	setPortBit(RADIO_NSS_PORT, RADIO_NSS_BIT);							//end SPI access - deactivate NSS line
}

void spiAccessRegisters2(uint8_t command, uint8_t *data, uint8_t length)
{
	resetPortBit(RADIO_NSS_PORT, RADIO_NSS_BIT);						//assert data frame start

	(void)SPI2->DR;														//read and discard RX buffer to clear RXNE, just in case

	SPI2->DR = command;													//send the address with the Write bit indicator
	while(0 == (SPI2->SR & SPI_SR_RXNE));								//wait until address transmits
	(void)SPI2->DR;														//discard dummy return, otherwise next byte returned would be lost

	while(length--)
	{
		SPI2->DR = *data;												//write a data byte
		while(0 == (SPI2->SR & SPI_SR_RXNE));							//wait until reply is ready
		*(data++) = SPI2->DR;											//save the reply
	}

	setPortBit(RADIO_NSS_PORT, RADIO_NSS_BIT);							//deactivate NSS line
}



void i2cWrite(uint8_t address, uint8_t *data, uint8_t length)
{
/* (1) Prepare acknowledge for Master data reception ************************/
LL_I2C_AcknowledgeNextData(I2C1, LL_I2C_ACK);

	LL_I2C_GenerateStartCondition(I2C1);						//Initiate a Start condition to the Slave device

	while(!LL_I2C_IsActiveFlag_SB(I2C1));						//wait until Start Bit transmitted (SB flag raised)

	LL_I2C_TransmitData8(I2C1, (address << 1));					//Send Slave address with a 7-Bit SLAVE_OWN_ADDRESS for a write request

	while(!LL_I2C_IsActiveFlag_ADDR(I2C1));						//wait until Address Acknowledgement received (ADDR flag raised)

	LL_I2C_ClearFlag_ADDR(I2C1);								//Clear ADDR flag value in ISR register

	while(length > 0)											//Transmit data
		if(LL_I2C_IsActiveFlag_TXE(I2C1)) {						//Check TXE flag value in ISR register and write next data before previous is transmitted
			LL_I2C_TransmitData8(I2C1, (*data++));				//Write data in Transmit Data register. TXE flag is cleared by writing data in TXDR register
			length--;
		}

	LL_I2C_GenerateStopCondition(I2C1);							//Generate Stop condition
}

void i2cRead(uint8_t address, uint8_t *data, uint8_t length)
{
	/* (1) Prepare acknowledge for Master data reception ************************/
	LL_I2C_AcknowledgeNextData(I2C1, LL_I2C_ACK);

