ubnt-Alexey-Kuvshinov/stm32projects/LoRaMote/src/stm32l152x_board.c
		LL_I2C_GenerateStartCondition(I2C1);						//Initiate a Start condition to the Slave device

		while(!LL_I2C_IsActiveFlag_SB(I2C1));						//wait until Start Bit transmitted (SB flag raised)

	LL_I2C_TransmitData8(I2C1, (address << 1) | I2C_REQUEST_WRITE);	//Send Slave address with a 7-Bit SLAVE_OWN_ADDRESS for a write request
}








inline void boardGreenLedOn(void)
{
	resetPortBit(AUX_GREEN_LED_PORT, AUX_GREEN_LED_BIT);
}

inline void boardGreenLedOff(void)
{
	setPortBit(AUX_GREEN_LED_PORT, AUX_GREEN_LED_BIT);
}

void boardGreenLedToggle(void)
{
	if(readPortBit(AUX_GREEN_LED_PORT, AUX_GREEN_LED_BIT))
		boardGreenLedOn();
	else
		boardGreenLedOff();
}

inline void boardYellowLedOn(void)
{
	resetPortBit(AUX_YELLOW_LED_PORT, AUX_YELLOW_LED_BIT);
}

inline void boardYellowLedOff(void)
{
	setPortBit(AUX_YELLOW_LED_PORT, AUX_YELLOW_LED_BIT);
}

void boardYellowLedToggle(void)
{
	if(readPortBit(AUX_YELLOW_LED_PORT, AUX_YELLOW_LED_BIT))
		boardYellowLedOn();
	else
		boardYellowLedOff();
}

inline void boardRedLedOn(void)
{
	resetPortBit(AUX_RED_LED_PORT, AUX_RED_LED_BIT);
}

inline void boardRedLedOff(void)
{
	setPortBit(AUX_RED_LED_PORT, AUX_RED_LED_BIT);
}

void boardRedLedToggle(void)
{
	if(readPortBit(AUX_RED_LED_PORT, AUX_RED_LED_BIT))
		boardRedLedOn();
	else
		boardRedLedOff();
}


void driveGreenLed(uint8_t high_low)
{
	if(high_low)
		boardGreenLedOn();
	else
		boardGreenLedOff();
}

void driveRedLed(uint8_t high_low)
{
	if(high_low)
		boardRedLedOn();
	else
		boardRedLedOff();
}

void driveRfSwitch(uint8_t switches)
{
	if(switches & 0b100)
		setPortBit(RF_SWITCH_CONTROL_1_PORT, RF_SWITCH_CONTROL_1_BIT);
	else
		resetPortBit(RF_SWITCH_CONTROL_1_PORT, RF_SWITCH_CONTROL_1_BIT);

	if(switches & 0b010)
		setPortBit(RF_SWITCH_CONTROL_2_PORT, RF_SWITCH_CONTROL_2_BIT);
	else
		resetPortBit(RF_SWITCH_CONTROL_2_PORT, RF_SWITCH_CONTROL_2_BIT);

	if(switches & 0b001)
		setPortBit(RF_PA_HIGH_PWR_PORT, RF_PA_HIGH_PWR_BIT);
	else
		resetPortBit(RF_PA_HIGH_PWR_PORT, RF_PA_HIGH_PWR_BIT);
}


void enterSleep(void)
{
	LL_PWR_ClearFlag_WU();												//ensure that the WUF  wake up flag is cleared
	LL_LPM_EnableDeepSleep();											//Set SLEEPDEEP bit of Cortex System Control Register
	__WFI();															//Request Wait For Interrupt

	//Request Wait For Event
/*	__SEV();
	__WFE();
	__WFE();
*/
	//TODO: is it necessary?
//	CLEAR_BIT(SCB->SCR, SCB_SCR_SLEEPDEEP_Msk);							//Reset SLEEPDEEP bit after exiting from Stop

	LL_RCC_HSI_Enable();												//Enable HSI
	while(0 == LL_RCC_HSI_IsReady());									//wait for HSI getting stable
	LL_RCC_SetSysClkSource(LL_RCC_SYS_CLKSOURCE_HSI);					//set HSI as system clock
}


void enterStandby(void)
{
	uart2SendText("Bye, going to StandBy");
	while(HardwareEvents & HWE_UART2_TRANSMITTING);						//wait until the message transmits

	LL_PWR_ClearFlag_WU();
	LL_PWR_ClearFlag_SB();
//	LL_PWR_EnableWakeUpPin(LL_PWR_WAKEUP_PIN2);
	LL_PWR_EnableWakeUpPin(LL_PWR_WAKEUP_PIN1);
	LL_LPM_EnableDeepSleep();
	LL_PWR_SetPowerMode(LL_PWR_MODE_STANDBY);

	__SEV();
	__WFE();
	__WFE();
}


//This function is executed in case of error occurrence
void ErrorHandler(char *msg)
{
	boardRedLedOn();
	uart2SendText(msg);
	while(1);
}

#ifdef  USE_FULL_ASSERT
//Reports the name of the source file and the source line number where the assert_param error has occurred
void assert_failed(uint8_t* file, uint32_t line)
{
//User can add his own implementation to report the file name and line number, ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line)
	while (1);
}
#endif
